#include <iostream>

using namespace std;
// Инструкция для робота "Как дойти до кабинета"
int main ()
    {
        cout << "Подойди к информативному посту.\n";
        cout << "Спроси: " << "На каком этаже находится кабинет 304?\n";
        cout << "Спроси: " << "Как пройти к лифту?\n";
        cout << "Иди к лифту следуя полученной инструкции\n";
        cout << "Подойдя к дверям лифта нажми кнопку вызывающую лифт\n";
        cout << "[Эта кнопка со стрелочкой]" << "[Если издает световой сигнал, то нажимать её не нужно]\n";
        cout << "Дождись когда лифт приедет\n";
        cout << "Зайди в лифт никого не толкая и пропуская женщин вперед\n";
        cout << "Нажми кнопку этажа" << "[Нужный тебе этаж содержится в ответе на первый вопрос]\n";
        cout << "Дождись когда лифт приедет на нужный этаж\n";
        cout << "Когда лифт остановится выйди\n";
        cout << "[Если впереди тебя стоят люди, то скажи: " << "Позвольте я выйду?]\n";
        cout << "Выйдя из лифта, поверни направо и стой ближе к правой стене, не косаясь её своим телом\n";
        cout << "Иди вдоль коридора пока не увидишь номер 304 на двери\n";
        cout << "Найдя нужную дверь повернись к ней лицом\n";
        cout << "Постучись в дверь\n";

        return 0;
    }