#include <iostream>

using namespace std;
// Как добраться из места жительства до работы
int main ()
    {
        cout << "Выйти с территории дома через ворота\n";
        cout << "Повернуть направа и идти прямо до остановки\n";
        cout << "Дождаться автобуса\n";
        cout << "Зайти в автобус, оплатив проезд с помощью карты или наличных денег\n";
        cout << "Доехать до конечной остановки\n";
        cout << "Выйти из автобуса, " << "зайти в метро через входную дверь\n";
        cout << "Пройти до турнекета, " << "у турникета оплатить проезд\n";
        cout << "Спуститься по эскалатору вниз и дождаться поезда\n";
        cout << "Сесть на поезд и доехать до станции метро Достоевская\n";
        cout << "Выйти из вагона, " << "выйти из метро, поднявшись по эскалатору\n";
        cout << "Повернуть направо, " << "затем дойти до остановки и повернуть на лево\n";
        cout << "Дойти до первого перекрестка и повернуть налево\n" << "Дойти до второго перекрестка и повернуть направо\n" << "Дойти до двери с надписью ХАДСОН\n";

        return 0;
    }